backend/app/controllers/exercises_controller.rb

SELECT "exercises".* FROM "exercises"
---
    def index
        @exercises = Exercise.all