backend/app/controllers/favorites_controller.rb

INSERT INTO "favorites" ("user_id", "exercise_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["exercise_id", 83], ["created_at", "2021-03-02 23:38:46.273304"], ["updated_at", "2021-03-02 23:38:46.273304"]]
---
    def create
        @new_favorite = Favorite.create(user_id: params[:user_id], exercise_id: params[:exercise_id])

SELECT "favorites".* FROM "favorites" WHERE "favorites"."exercise_id" = ? LIMIT ?  [["exercise_id", 82], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 4]]
---
    def destroy
        @favorite = Favorite.where({ exercise_id: params[:id], user_id: params[:user_id] })
        @favorite.destroy(@favorite[0].id)