backend/app/controllers/users_controller.rb

    def login
        @user = User.find_by(username: params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Phil"], ["LIMIT", 1]]

    def create
        @new_user = User.create(username: params[:username], password: params[:password])
---
INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "kitkat"], ["password", "pw"], ["created_at", "2021-03-02 22:49:49.204190"], ["updated_at", "2021-03-02 22:49:49.204190"]]